import 'package:flutter/material.dart';

//BuildContext คือกุญแจสำหรับเชื่อมโยงและเข้าถึงข้อมูลหรือฟังก์ชันต่าง ๆ ใน Widget tree ของ Flutter
void showMessageDialog(BuildContext context, String title, String message, AssetImage image) {
  showDialog(
    context: context,
    builder: (BuildContext context) {
      return AlertDialog(
        
        title: Text(title),
        content: Column(
          mainAxisSize: MainAxisSize.min,
          children: [
            Image(image: image, height: 200,width: 220, fit: BoxFit.cover),
            SizedBox(height: 16),
            Text(message),
          ],
        ),
        actions: [
          TextButton(
            child: const Text('OK'),
            onPressed: () {
              Navigator.of(context).pop();
            },
          ),
        ],
      );
    },
  );
}

class Info {
  final String title;
  final String message;
  final AssetImage image;

  Info({required this.title, required this.message, required this.image});
}

List<Info> info_vegetable_List = [
  Info(
    title: 'กำแพงเมืองจีน (Great Wall of China)',
    message: '  เป็นกำแพงที่มีป้อมคั่นเป็นช่วง ๆ ของจีนสมัยโบราณ สร้างขึ้นเพื่อป้องกันการรุกรานจากชนเผ่าต่างๆ ทางตอนเหนือ โดยมีการก่อสร้างต่อเนื่องมาหลายยุคหลายสมัย ปัจจุบันมีความยาวรวมประมาณ 21,196 กิโลเมตร ถือเป็นสิ่งมหัศจรรย์ของโลกและเป็นมรดกโลก',
    image: AssetImage('images/greatwall.jpg'),
  ),
  Info(
    title: 'อนุสาวรีย์เทพีเสรีภาพ (Statue of Liberty)',
    message: '  เป็นประติมากรรมนีโอคลาสสิก ขนาดมหึมาบนเกาะลิเบอร์ตีในท่าเรือนิวยอร์ก ภายในนครนิวยอร์ก รูปปั้นที่หุ้มด้วยทองแดงนี้เป็นของขวัญจากประชาชนชาวฝรั่งเศสที่มอบให้แก่สหรัฐอเมริกา ออกแบบโดยประติมากรชาวฝรั่งเศส เฟรเดริก โอกุสต์ บาร์โตลดี และมีโครงสร้างโลหะที่สร้างโดย กุสตาฟ ไอเฟล ',
    image: AssetImage('images/newyork.jpg'),
  ),
  Info(
    title: 'หอไอเฟล (Eiffel Tower)',
    message: 'เป็นหอคอยโครงเหล็กที่ตั้งอยู่ในกรุงปารีส ประเทศฝรั่งเศส สร้างขึ้นโดย กุสตาฟ ไอเฟล ในปี ค.ศ. 1887–1889 เพื่อเป็นสัญลักษณ์ของงานแสดงสินค้าโลกปี 1889 และเป็นสิ่งก่อสร้างที่สูงสุดในปารีส ด้วยความสูงปัจจุบันประมาณ 330 เมตร (1,083 ฟุต) แบ่งออกเป็น 3 ชั้น มีทั้งร้านอาหาร, ร้านค้า, และจุดชมวิวที่สามารถมองเห็นวิวทิวทัศน์ของกรุงปารีสได้',
    image: AssetImage('images/paris.jpg'),
  ),
  Info(
    title: 'มาชูปิกชู (Machu Picchu)',
    message: '  รู้จักในชื่อ "เมืองสาบสูญแห่งอินคา" ตั้งอยู่บนยอดเขาในเทือกเขาแอนดีส ประเทศเปรู สร้างขึ้นในศตวรรษที่ 15 และถูกทิ้งร้างในช่วงการล่าอาณานิคมของสเปน ปัจจุบันได้รับการขึ้นทะเบียนเป็นมรดกโลกจากองค์การยูเนสโก',
    image: AssetImage('images/Peru.jpg'),
  ),
  Info(
    title: 'พีระมิดแห่งกิซ่า (Pyramids of Giza)',
    message: '  เป็นกลุ่มพีระมิดที่ตั้งอยู่ในเมืองกิซ่า ประเทศอียิปต์ ซึ่งเป็นหนึ่งในเจ็ดสิ่งมหัศจรรย์ของโลกสมัยโบราณ พีระมิดที่มีชื่อเสียงที่สุดคือ พีระมิดของฟาโรห์คูฟู (Khufu) ที่สร้างขึ้นในช่วงประมาณ 2580–2560 ปีก่อนคริสตกาล',
    image: AssetImage('images/pyramids-giza.jpg')
  ),
  Info(
    title: 'โคลอสเซียม (Colosseum)',
    message: '  เป็นสนามกีฬากลางแจ้งที่ตั้งอยู่ในกรุงโรม ประเทศอิตาลี สร้างขึ้นในศตวรรษที่ 1 เพื่อใช้ในการต่อสู้ของนักรบและการแสดงต่างๆ ถือเป็นหนึ่งในสัญลักษณ์ที่สำคัญของกรุงโรม',
    image: AssetImage('images/rome.jpg')
  ),
];

List<Info> info_exercise_List = [
  Info(
    title: 'gae',
    message: '  เป็นกำแพงที่มีป้อมคั่นเป็นช่วง ๆ ของจีนสมัยโบราณ สร้างขึ้นเพื่อป้องกันการรุกรานจากชนเผ่าต่างๆ ทางตอนเหนือ โดยมีการก่อสร้างต่อเนื่องมาหลายยุคหลายสมัย ปัจจุบันมีความยาวรวมประมาณ 21,196 กิโลเมตร ถือเป็นสิ่งมหัศจรรย์ของโลกและเป็นมรดกโลก',
    image: AssetImage('images/greatwall.jpg'),
  ),
  Info(
    title: 'อนุสาวรีย์เทพีเสรีภาพ (Statue of Liberty)',
    message: '  เป็นประติมากรรมนีโอคลาสสิก ขนาดมหึมาบนเกาะลิเบอร์ตีในท่าเรือนิวยอร์ก ภายในนครนิวยอร์ก รูปปั้นที่หุ้มด้วยทองแดงนี้เป็นของขวัญจากประชาชนชาวฝรั่งเศสที่มอบให้แก่สหรัฐอเมริกา ออกแบบโดยประติมากรชาวฝรั่งเศส เฟรเดริก โอกุสต์ บาร์โตลดี และมีโครงสร้างโลหะที่สร้างโดย กุสตาฟ ไอเฟล ',
    image: AssetImage('images/newyork.jpg'),
  ),
  Info(
    title: 'หอไอเฟล (Eiffel Tower)',
    message: 'เป็นหอคอยโครงเหล็กที่ตั้งอยู่ในกรุงปารีส ประเทศฝรั่งเศส สร้างขึ้นโดย กุสตาฟ ไอเฟล ในปี ค.ศ. 1887–1889 เพื่อเป็นสัญลักษณ์ของงานแสดงสินค้าโลกปี 1889 และเป็นสิ่งก่อสร้างที่สูงสุดในปารีส ด้วยความสูงปัจจุบันประมาณ 330 เมตร (1,083 ฟุต) แบ่งออกเป็น 3 ชั้น มีทั้งร้านอาหาร, ร้านค้า, และจุดชมวิวที่สามารถมองเห็นวิวทิวทัศน์ของกรุงปารีสได้',
    image: AssetImage('images/paris.jpg'),
  ),
  Info(
    title: 'มาชูปิกชู (Machu Picchu)',
    message: '  รู้จักในชื่อ "เมืองสาบสูญแห่งอินคา" ตั้งอยู่บนยอดเขาในเทือกเขาแอนดีส ประเทศเปรู สร้างขึ้นในศตวรรษที่ 15 และถูกทิ้งร้างในช่วงการล่าอาณานิคมของสเปน ปัจจุบันได้รับการขึ้นทะเบียนเป็นมรดกโลกจากองค์การยูเนสโก',
    image: AssetImage('images/Peru.jpg'),
  ),
  Info(
    title: 'พีระมิดแห่งกิซ่า (Pyramids of Giza)',
    message: '  เป็นกลุ่มพีระมิดที่ตั้งอยู่ในเมืองกิซ่า ประเทศอียิปต์ ซึ่งเป็นหนึ่งในเจ็ดสิ่งมหัศจรรย์ของโลกสมัยโบราณ พีระมิดที่มีชื่อเสียงที่สุดคือ พีระมิดของฟาโรห์คูฟู (Khufu) ที่สร้างขึ้นในช่วงประมาณ 2580–2560 ปีก่อนคริสตกาล',
    image: AssetImage('images/pyramids-giza.jpg')
  ),
  Info(
    title: 'โคลอสเซียม (Colosseum)',
    message: '  เป็นสนามกีฬากลางแจ้งที่ตั้งอยู่ในกรุงโรม ประเทศอิตาลี สร้างขึ้นในศตวรรษที่ 1 เพื่อใช้ในการต่อสู้ของนักรบและการแสดงต่างๆ ถือเป็นหนึ่งในสัญลักษณ์ที่สำคัญของกรุงโรม',
    image: AssetImage('images/rome.jpg')
  ),
];